app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "waregsetdf"], ["room_number", "123"], ["created_at", "2019-11-11 03:55:40.051030"], ["updated_at", "2019-11-11 03:55:40.051030"]]
---
    def create
        @school_class=SchoolClass.create(school_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analyses"], ["room_number", ""], ["updated_at", "2019-11-11 04:23:34.451932"], ["id", 1]]
---
    def update
        @school_class=SchoolClass.find(params[:id])
        @school_class.update(school_params)